# Задача 2: Найдите сумму цифр
# трехзначтого числа.
# 123 - > 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


a = int(input('введите трехзначное число '))
result1 = a%10
result2 = (a%100)//10
result3 = (a%1000)//100
print(f'{result1} + {result2} + {result3}')
print(f'результат сложения цифр в числе =  {result1 + result2 + result3}')
# w